CSI API ETABS v1

# cComboAddDesignDefaultCombos Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int AddDesignDefaultCombos(
    	bool DesignSteel,
    	bool DesignConcrete,
    	bool DesignAluminum,
    	bool DesignColdFormed
    )

    Function AddDesignDefaultCombos (
    	DesignSteel As Boolean,
    	DesignConcrete As Boolean,
    	DesignAluminum As Boolean,
    	DesignColdFormed As Boolean
    ) As Integer

    Dim instance As cCombo
    Dim DesignSteel As Boolean
    Dim DesignConcrete As Boolean
    Dim DesignAluminum As Boolean
    Dim DesignColdFormed As Boolean
    Dim returnValue As Integer

    returnValue = instance.AddDesignDefaultCombos(DesignSteel,
    	DesignConcrete, DesignAluminum,
    	DesignColdFormed)

    int AddDesignDefaultCombos(
    	bool DesignSteel,
    	bool DesignConcrete,
    	bool DesignAluminum,
    	bool DesignColdFormed
    )

    abstract AddDesignDefaultCombos :
            DesignSteel : bool *
            DesignConcrete : bool *
            DesignAluminum : bool *
            DesignColdFormed : bool -> int

#### Parameters

DesignSteel

    Type: SystemBoolean

DesignConcrete

    Type: SystemBoolean

DesignAluminum

    Type: SystemBoolean

DesignColdFormed

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cCombo Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com